AcRxQueryXOverrule.queryX(AcRxObject!System.Runtime.CompilerServices.IsConst*,AcRxClass!System.Runtime.CompilerServices.IsConst*)
Overrules AcRxObject::queryX.
pSubject: Pointer to an AcRxObject that this overrule is applied against.
Returns: Returns a protocol extension object associated with this object
Remarks:
The default implementation of AcRxQueryXOverrule::queryX calls the
protected AcRxObject::subQueryX method.

AcRxQueryXOverrule.#ctor
Default Constructor.

AcRxQueryXOverrule
AcRxQueryXOverrule overrules the queryX method of AcRxObject